Feature: parking

Scenario: จอดรถ 0-1 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 00:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 00:30:00"
    When จำนวนเวลาจอดรถ 0 - 1 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 25 บาท

Scenario: จอดรถ 1-2 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 02:00:01"
    When จำนวนเวลาจอดรถ 1 - 2 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 50 บาท

Scenario: จอดรถ 2-3 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 03:00:01"
    When จำนวนเวลาจอดรถ 2 - 3 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 80 บาท

Scenario: จอดรถ 3-4 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 04:00:01"
    When จำนวนเวลาจอดรถ 3 - 4 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 110 บาท

Scenario: จอดรถ 4-5 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 05:00:01"
    When จำนวนเวลาจอดรถ 4 - 5 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 145 บาท

Scenario: จอดรถ 5-6 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 06:00:01"
    When จำนวนเวลาจอดรถ 5 - 6 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 180 บาท

Scenario: จอดรถ 7-24 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 01:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 07:00:01"
    When จำนวนเวลาจอดรถ 7 - 24 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 250 บาท

Scenario: จอดรถ 7-24 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 23:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "20-08-2018 00:00:00"
    When จำนวนเวลาจอดรถ 0 - 1 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 25 บาท

Scenario: จอดรถ 7-24 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 15:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "19-08-2018 15:59:00"
    When จำนวนเวลาจอดรถ 0 - 1 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 25 บาท

Scenario: จอดรถ 7-24 ชั่วโมง
    Given ขับรถมาถึงจุดรับบัตร รับบัตรจอดรถ เมื่อเวลา "19-08-2018 00:00:00" และ ขับรถออกมาคืนบัตร เมื่อเวลา "20-08-2018 00:00:00"
    When จำนวนเวลาจอดรถ 7 - 24 ชั่วโมง
    Then ฉันต้องจ่ายเงิน 250 บาท